
## 엔터티는 뭘까?

> 개발 하면서 거의 백만번은 들어본 거 같다. 나는 엔터티에 대해 설명할 수 있을까?
> Q. 엔터티가 뭐야?
> A. 논리적 관점의 릴레이션, 물리적 관점의 테이블과 매핑되는 데이터 집합의 단위야.

> 아무개: 잠깐!! 너의 설명은 틀렸어!!! 
> 그건 DB 관점의 엔터티에만 해당하는 내용이고 객체 관점의 엔터티는 특정 객체나 클래스를 설명하는 개념이 될 수도 있어.

<br><br>
  
Q. 엔터티의 원래 뜻은 뭔데?
A. 업무에 필요하고 유용한 정보를 저장하고 관리하기 위한 집합적인 것

따라서 DB의 테이블, 객체지향의 클래스나 객체 모두 엔터티로 볼 수 있다.
* 엔티티나 엔터티나 둘 다 맞다. 
* 엔티티는 실재를 의미한다. 


[실재와 실제의 차이]
"실재하는": 이 표현은 대상이 현실에 존재하는, 즉 실체를 가지고 있다는 의미를 강조합니다. 
           '실재하는'은 보통 물리적으로 존재하거나 인식될 수 있는 객체나 대상을 지칭합니다.

"실제의 것": '실제의 것'이라는 표현은 특정한 대상이나 사물이 진짜로 존재하거나, 현실적이라는 의미로 사용됩니다. 
             이는 '가상의 것'이나 '상상의 것'과 대비되는 개념입니다.


